{
    "articles": [
        {
            "id": 1,
            "name": "Melodia",
            "text": "Tech Stack: html5, css3, jQuery, canvas, web audio api, express.js<br />\nLive Preview: https://melodia.shadmehri.xyz/<br /><br />\nMelodia is a project that I created in 2015 to help music students learn more easily. I made four different web apps for this purpose:<br />\n<ul>\n <li>Sight-reading apps that prompts users to identify notes or locate them on an instrument.</li>\n <li>Ear-training apps that allows users to listen to notes, intervals, and chords and identify them.</li>\n <li>A web app that plays music pieces with interactive animation on a musical instrument, with the ability to adjust the tempo.</li>\n <li>Some web apps that makes it possible for users to play an instrument online and record what they have played.</li>\n</ul>\nInitially, these apps were created mainly for Persian musical instruments, but now you can access some of them on the following link: https://melodia.shadmehri.xyz/<br /><br />\nFor the version that is online now, I used a simple Express app to handle the different routes.<br /><br />\nThis project presented a lot of challenges, especially in terms of playing music pieces or recording and playing back what the user has played on the instrument. To achieve this, I used the following approach:<br />\n<ul>\n <li>I loaded all the sounds of the musical instrument.</li>\n <li>I saved all the music melody notes in one array.</li>\n <li>I saved the rhythm of all music notes in another array.</li>\n <li>With the above arrays, I played each note at a specific time.</li>\n <li>I made another web app to calculate when each note should be played by considering its rhythm. This app created those arrays I mentioned.</li>\n</ul>\nThis approach may seem easy, but it becomes much more complicated than you imagine when you want to add grace notes, triplets or slurs, and you can see many math calculations are required.<br /><br />\nThe challenges of this project were not limited to calculations and how to use Web Audio API to play harmonic notes or single notes or how to draw and play more than 40 different type of chords, etc. Displaying instruments, music staff, and notes and making them responsive was not easy too.<br /><br />\nTo display all music notes, flat and sharp signs, I used canvas and wrote many functions to draw what you see. Additionally, for displaying instruments like the piano and showing green and red circles on the piano keys, as you can see in the music dictation app, I used some creative ways to use CSS."
        }
    ]
}
